import React, {Fragment, useState} from 'react';
import {
  View,
  Text,
  SafeAreaView,
  Image,
  ScrollView,
  TouchableOpacity,
  ImageBackground,
  Modal,
  Dimensions,
  TextInput,
} from 'react-native';
import Headerback from '../../Components/Headerback';
import styles from './styles';
import {connect} from 'react-redux';
const Term = ({navigation, dispatch}) => {
  return (
    <View style={styles.container}>
      <SafeAreaView style={{backgroundColor: '#23232390'}}>
        <Headerback navigation={navigation} item={'TERMS OF USE'} />

        <ScrollView>
          <View style={styles.view}>
            <Text style={styles.textdetail}>
              "นโยบายความเป็นส่วนตัวของกรมสำหรับการใช้งานแอปพลิเคชันด้านล่าง
              ซึ่งต่อไปนี้จะเรียกว่า “แอปพลิเคชัน”
              โปรดอ่านและทำความเข้าใจนโยบายความเป็นส่วนตัวนี้อย่างละเอียด
              การที่ท่านได้ติดตั้ง และ/หรือเข้าใช้งานแอปพลิเคชันนี้แล้ว
              ถือว่าท่านตกลงยอมรับข้อกำหนดที่ระบุในนโยบายความเป็นส่วนตัวนี้แล้วทุกประการหากท่านไม่สามารถยอมรับข้อกำหนดนโยบายความเป็นส่วนตัวนี้ได้
              ขอให้ท่านปฏิเสธการใช้งานแอปพลิเคชันโดยถอนการติดตั้งแอปพลิเคชันจากเครื่องโทรศัพท์เคลื่อนที่/อุปกรณ์ดิจิตอลของท่านทันที
              {'\n'}1.
              วัตถุประสงค์ของนโยบายความเป็นส่วนตัวในการใช้งานแอปพลิเคชันนี้
              กรมมีความประสงค์ที่จะแจ้งให้ท่านทราบอย่างชัดเจนว่ากรมรวบรวมข้อมูลอะไรของท่านบ้าง
              มีวิธีการใช้และแบ่งปันข้อมูลของท่านอย่างไร
              นโยบายความเป็นส่วนตัวนี้จะอธิบายถึง{'\n'}-
              ข้อมูลที่รวบรวมและเหตุผลที่รวบรวม {'\n'}- การใช้ข้อมูลที่รวบรวม
              กรมจะใช้ข้อมูลที่รวบรวมจากแอปพลิเคชันทั้งหมดของกรม เพื่อให้บริการ
              บำรุงรักษา ป้องกัน ปรับปรุง พัฒนาบริการใหม่ๆ และปกป้องกรมและท่าน
              ตลอดจนเพื่อนำเสนอเนื้อหาที่ได้รับการปรับแต่ง (Customize)
              ให้เหมาะสมกับการใช้งานของท่านโดยเฉพาะ เช่น
              แสดงผลการค้นหาที่เกี่ยวข้องกับท่าน
              แสดงโฆษณาประชาสัมพันธ์บริการที่ท่านอาจสนใจและเป็นประโยชน์แก่ท่าน
              {'\n'}เมื่อท่านติดต่อมายังกรม
              กรมอาจเก็บบันทึกข้อมูลการสนทนาระหว่างท่าน กับ Call Center
              ที่กรมจัดหามาไว้สำหรับเป็นช่องทางการรับแจ้ง ให้คำปรึกษา
              แนะนำวิธีการแก้ปัญหาที่เกี่ยวข้องกับการใช้งานแอปพลิเคชัน
              และอาจเก็บบันทึกที่อยู่อีเมลล์ที่ท่านแจ้งไว้เพื่อรับคำแนะนำต่างๆ
              ทั้งนี้ เพื่อนำมาปรับปรุงและพัฒนาการให้บริการของกรม และกรมในเครือ
              และแจ้งให้ท่านทราบผ่านที่อยู่ที่ท่านแจ้งไว้ได้
              {'\n'}
              {'\n'}
              กรมอาจใช้ข้อมูลที่รวบรวมได้จากคุกกี้และเทคโนโลยีอื่นๆ เช่น การใช้
              Tag เป็นต้น ในการปรับปรุงประสบการณ์การใช้งานของท่าน
              และคุณภาพโดยรวมของแอปพลิเคชัน {'\n'}
              {'\n'}ข้อมูลที่แบ่งปัน{'\n'}
              กรมจะไม่นำข้อมูลของท่านไปแบ่งปันหรือเปิดเผยให้กับกรม
              และ/หรือองค์กรอื่น และ/หรือบุคคลภายนอก ยกเว้นกรณี ดังต่อไปนี้
              {'\n'}-เมื่อได้รับความยินยอมจากท่าน
              กรมอาจแบ่งปันหรือเปิดเผยข้อมูลส่วนบุคคลของท่านกับกรม
              และ/หรือองค์กรอื่น และ/หรือบุคคลภายนอก
              เมื่อได้รับความยิมยอมจากท่านให้แบ่งปันหรือเปิดเผยข้อมูลส่วนบุคคลที่ละเอียดอ่อนของท่านก่อน
              เพื่อ
              “การใช้ข้อมูลที่รวบรวม”กรมอาจแบ่งปันหรือเปิดเผยข้อมูลส่วนบุคคลของท่านกับกรมในเครือ
              กรมในกลุ่ม
              ตลอดจนคู่สัญญาที่มีหน้าที่บริหารจัดการแอปพลิเคชันตามสัญญากับกรมโดยตรง
              หรือกรมอื่นที่มีนโยบายเกี่ยวกับข้อมูลส่วนบุคคลที่น่าเชื่อถือ
              เพื่อให้บริการ บำรุงรักษา ป้องกัน ปรับปรุง พัฒนาบริการใหม่ๆ
              และปกป้องกรมและท่าน ตลอดจนเพื่อนำเสนอเนื้อหาที่ได้รับการปรับแต่ง
              (Customize) ให้เหมาะสมกับการใช้งานของท่านโดยเฉพาะ เช่น
              แสดงผลการค้นหาที่เกี่ยวข้องกับท่าน
              แสดงโฆษณาประชาสัมพันธ์บริการที่ท่านอาจสนใจและเป็นประโยชน์แก่ท่าน
              โดยดำเนินการตามคำแนะนำและตามนโยบายส่วนบุคคลของกรม
              รวมถึงมาตรการการรักษาข้อมูลที่เป็นความลับและการรักษาความปลอดภัยที่เหมาะสม
              {'\n'}สำหรับเหตุผลทางกฎหมาย
              กรมอาจแบ่งปันหรือเปิดเผยข้อมูลของท่านกับกรม และ/หรือองค์กรอื่น
              และ/หรือบุคคลภายนอก หากกรมเชื่อโดยสุจริตว่าการเข้าถึง การใช้
              การเก็บรักษา หรือการเปิดเผยข้อมูลนั้น มีเหตุจำป็นอันสมควร (1)
              เพื่อการปฏิบัติตามกฎหมาย ระเบียบข้อบังคับ หลักเกณฑ์
              คำสั่งที่เกี่ยวข้องและการร้องขอข้อมูลจากทางราชการ (2)
              เพื่อบังคับใช้ข้อกำหนดในการให้บริการที่เกี่ยวข้อง
              รวมถึงการตรวจสอบการละเมิดที่อาจเกิดขึ้น (3) เพื่อตรวจจับ ป้องกัน
              หรือตรวจสอบการทุจริต ปัญหาด้านความปลอดภัยหรือด้านเทคนิค (4)
              เพื่อป้องกันอันตรายต่อสิทธิ ทรัพย์สิน
              หรือความปลอดภัยของกรมและ/หรือของท่าน
              หรือบุคคลอื่นตามที่กฎหมายกำหนด
              {'\n'}กรมอาจแบ่งปันข้อมูลที่ไม่สามารถระบุตัวผู้ใช้งานแอปพลิเคชัน
              เช่น ผลการค้นหา เครื่อข่ายโทรศัพท์เคลื่อนที่ที่ใช้งาน ภาษาที่ใช้
              เว็บไซต์ที่เข้าชมบ่อย เป็นต้น
              ต่อสาธารณะหรือให้แก่พันธมิตรทางการค้าของกรม เช่น ผู้เผยแพร่โฆษณา
              ผู้ลงโฆษณา หรือเว็บไซต์ที่เชื่อมโยงกัน เช่น
              กรมอาจแบ่งปันข้อมูลที่แสดงแนวโน้มการใช้งานแอปพลิเคชัน สู่สาธารณะ
              เป็นต้นหากกรมมีการเปลี่ยนแปลงโครงสร้างการบริหารงาน เช่น
              การควบรวมกิจการ การได้มา หรือการขายสินทรัพย์
              กรมจะยังคงรักษาข้อมูลส่วนบุคคลใดๆ ให้เป็นความลับ
              และแจ้งให้ผู้ใช้งานแอปพลิเคชันที่ได้รับผลกระทบทราบก่อนการโอนข้อมูลส่วนบุคคล
              หรือให้ข้อมูลส่วนบุคคลนั้นอยู่ภายใต้นโยบายความเป็นส่วนตัวอื่นๆ
              {'\n'} 2. ความปลอดภัยของข้อมูล
              กรมพยายามอย่างยิ่งที่จะปกป้องข้อมูลของท่านจากการเข้าถึง
              การแก้ไขเปลี่ยนแปลง การเปิดเผย หรือการทำลายโดยไม่ได้รับอนุญาต
              อย่างน้อยดังนี้- กรมตรวจสอบการเก็บรวบรวมข้อมูล
              พื้นที่ในการจัดเก็บข้อมูลและหลักปฏิบัติในการประมวลผล
              รวมถึงมาตรการความปลอดภัยทางกายภาพ
              เพื่อป้องกันการเข้าถึงข้อมูลโดยไม่ได้รับอนุญาต
              กรมจำกัดการเข้าถึงข้อมูลส่วนบุคคลไว้เฉพาะกับพนักงาน ลูกจ้าง
              และตัวแทนของกรม ที่มีความจำเป็นต้องเข้าถึงข้อมูลนั้นๆ (Need to
              Know Basis) เพื่อทำการประมวลผลข้อมูล โดยที่บุคคลดังกล่าวนั้น
              จะต้องปฏิบัติตามข้อกำหนดเกี่ยวกับการรักษาข้อมูลที่เป็นความลับตามสัญญาอย่างเคร่งครัด
              หากฝ่าฝืนจะมีบทลงโทษขั้นรุนแรง {'\n'}3.
              ข้อจำกัดการใช้นโยบายความเป็นส่วนตัว นโยบายความเป็นส่วนตัวฉบับนี้
              มีผลใช้บังคับกับแอปพลิเคชันนี้เท่านั้น
              ไม่รวมถึงแอปพลิเคชันและ/หรือบริการที่มีนโยบายความเป็นส่วนตัว
              แยกต่างหาก
              และ/หรือที่ไม่ได้กำหนดโดยชัดแจ้งให้ใช้ร่วมกันกับนโยบายความเป็นส่วนตัวนี้
              ตลอดจนไม่มีผลใช้บังคับกับแอปพลิเคชันและบริการ หรือเว็บไซต์อื่นๆ
              ที่เชื่อมต่อ (link) กับแอปพลิเคชันนี้
              รวมถึงไม่ครอบคลุมหลักปฏิบัติด้านข้อมูลส่วนบุคคลของกรมอื่นๆ
              หรือองค์กรอื่นๆ ที่โฆษณาแอปพลิเคชันของกรม ซึ่งอาจใช้คุกกี้
              พิกเซลแท็ก และเทคโนโลยีอื่นๆ ในการนำเสนอและแสดงโฆษณาที่เกี่ยวข้อง
              {'\n'}4.
              การปฏิบัติตามกฎหมายและการให้ความร่วมมือกับหน่วยงานกำกับดูแล
              กรมดำเนินการตรวจสอบและทบทวนการปฏิบัติตามนโยบายความเป็นส่วนตัว
              และการปฏิบัติตามกฎหมายที่เกี่ยวข้อง ภายในองค์กรอย่างสม่ำเสมอ
              (Self-Regulator)
              หากกรมได้รับหนังสือร้องเรียนเกี่ยวกับการใช้ข้อมูลส่วนบุคคล
              กรมจะดำเนินการติดตามผล
              ตลอดจนให้ความร่วมมือกับหน่วยงานของรัฐที่มีอำนาจกำกับดูแลการให้บริการแอปพลิเคชัน
              และหน่วยงานคุ้มครองผู้บริโภคต่างๆ {'\n'}5.
              การเปลี่ยนแปลงนโยบายความเป็นส่วนตัว
              กรมขอสงวนสิทธิ์ในการแก้ไขเปลี่ยนแปลงนโยบายความเป็นส่วนตัวนี้ได้ตลอดเวลา
              โดยไม่ต้องได้รับความยินยอมจากท่านล่วงหน้า
              เว้นแต่เป็นการแก้ไขเปลี่ยนแปลงที่เป็นการริดรอนสิทธิของท่านตามนโยบายความเป็นส่วนตัวนี้
              กรมจะกระทำมิได้หากไม่ได้รับความยินยอมจากท่านก่อน {'\n'}6.
              การเข้าถึงและอัปเดตข้อมูลส่วนบุคคล กรมมุ่งหวังเป็นอย่างยิ่งว่า
              ในการใช้แอปพลิเคชัน ท่านสามารถเข้าถึงข้อมูลส่วนบุคคลของท่านได้
              หากข้อมูลดังกล่าวมีความบกพร่องหรือไม่ถูกต้อง
              กรมจะพยายามจัดหาวิธีการ
              และ/หรือช่องทางให้ท่านสามารถอัปเดตและ/หรือลบข้อมูลส่วนบุคคลของท่านได้อย่างเหมาะสม
              เว้นแต่
              ในกรณีมีความจำเป็นที่กรมจะต้องจัดเก็บข้อมูลส่วนบุคคลของท่านไว้
              เพื่อประโยชน์ทางธุรกิจ
              และ/หรือเพื่อการปฏิบัติตามกฎหมายที่ใช้บังคับ
              เมื่อท่านดำเนินการอัปเดตข้อมูลส่วนบุคคลของท่าน
              กรมอาจร้องขอให้ท่านยืนยันตัวตนก่อนที่กรมจะดำเนินการตามคำขอของท่านได้
              ทั้งนี้
              กรมขอสงวนสิทธิ์ปฏิเสธการทำคำขออัปเดตและการเข้าถึงข้อมูลส่วนบุคคลของท่าน
              ในกรณีดังต่อไปนี้ (1) การทำคำขอที่ซับซ้อนและมีจำนวนมากเกินกว่าปกติ
              (2) การดำเนินการตามคำขออาจทำให้กรมต้องจัดหา
              และ/หรือพัฒนาเทคโนโลยีจากที่กรมมีอยู่เกินสมควร (3)
              การดำเนินการตามคำขออาจกระทบข้อมูลส่วนบุคคลของผู้ใช้งานแอปพลิเคชันอื่นๆ
              หรือ (4) การดำเนินการตามคำขอไม่สามารถปฏิบัติได้จริง เช่น
              คำขอเกี่ยวกับการเรียกดูข้อมูลส่วนบุคคลที่อยู่ในระบบสำรองข้อมูล
              {'\n'}
              {'\n'}
              กรมมุ่งหวังที่จะดำเนินการให้บริการแอปพลิเคชันของกรมเป็นไปอย่างปลอดภัย
              และสามารถป้องกันการทำลายข้อมูลจากอุบัติเหตุหรือการมุ่งร้ายอื่นๆ
              ด้วยเหตุนี้ ภายหลังจากที่ท่านลบข้อมูลออกจากแอปพลิเคชันของกรมแล้ว
              กรมอาจยังไม่ดำเนินการลบสำเนาข้อมูลส่วนบุคคลที่มีอยู่ออกจากเซิร์ฟเวอร์ที่ใช้งานอยู่
              หรือนำข้อมูลออกจากระบบสำรองของกรมในทัน"
            </Text>
            <View style={{marginBottom: 50}} />
          </View>
        </ScrollView>
      </SafeAreaView>
    </View>
  );
};
// const mapStateToProps = state => ({
//   authData: state.authReducer.authData,
// });
const mapDispatchToProps = dispatch => ({
  dispatch,
});

export default connect(null, mapDispatchToProps)(Term);
